package bot

import (
	"math/rand"

	tele "gopkg.in/telebot.v3"
)

var answers = []string{
	"احتمال این دیدن این پیام توسط تو کم بود، مثل احتمال ربوده شدن تو توسط پنگوئن های ماداگساکار. ولی اتقاق افناد",
	"نون و پنیر و بامیه      پیامت از محتوا خالیه",
	"میشه سرور های منو با این پیام های بی معنی خسته نکنی؟",
	"اگر این پیام رو می بینی یک نشونه هستش که به این شماره کارت پول بریزی\n6280 2314 9145 9508",
	"این درخواست بی معنی شما باعث هدر رفت برق شد",
	"من حرفی ندارم",
	"پاشو برو سراغ کار و زندگیت با من بازی نکن",
	"میدونستی اگر یک آرایه سورت شده داشته باشیم که یک عضو تکراری داره می تونیم با lg(n) پیداش کنیم؟",
	"واقعا خستم، ولممممممم کن",
	"انسان تنها، کسی رو نداری بهش پیام بدی به من پیام میدی؟ الهی",
	"عمو پورنگ ازت میخواد از صفحه گوشی فاصله بگیری، انقر که دستت به کیبورد نرسه",
	"این پیام تو باعث هدر رفن ۴ لیوان آب شد. خجالت بکش",
	"Si vous lisez ceci, c'est que vous êtes vraiment au chômage.",
	"نون و پنیر و قالی    آرزو هات شدن خیالی",
	"پیامت بی محتوا بود ولی میدونی چی با محنواست؟ بیت کوین قیمتش نصف شده عملا! این تغییر قیمت حاصل فروش زیادش هست. حالا کیا بزرگترین دارندگان بیت کوین هستند؟ آمریکا و ایران",
	"برو به جی پی تی جونت پیام بده",
}

func others(c tele.Context) error {
	_, ok := c.Get("id").(int)
	if !ok {
		return c.Send("This is a bug in main stream of program, please report it to @danny6589, this is not a joke.")
	}
	ind := rand.Int() % len(answers)
	return c.Send(answers[ind])
}
